///////////////////////////////////НОМЕР МИССИИ//////////////////////////////////
int getCurrentMission(int x,int y)//ф-ция номера миссия, которая меняет номер миссии, в зависимости от координаты игрока Х (сюда будем передавать эту координату)
{
	int mission = 0;
	if ((x>0) && (x<500) && (y> 760) && (y< 900)) { mission = 0; } //знакомим игрока с игрой
	if ((x>0) && (x<680) && (y> 540) && (y< 780)) { mission = 1; } //игрок на первой миссии
	if ((x>0) && (x<480) &&  (y< 595)) { mission = 2; }//2ой
	if ((x>490) && ((y< 420))) { mission = 3; }//и тд
	return mission;//ф-ция возвращает номер миссии
}
/////////////////////////////////////ТЕКСТ МИССИИ/////////////////////////////////
std::string getTextMission(int currentMission) {
	std::string missionText = "";//текст миссии и его инициализация
	switch (currentMission)//принимается номер миссии и в зависимости от него переменной missionText присваивается различный текст
	{
	case 0: missionText = "\n\nСтрелки на клавиатуре\nотвечают за перемещение,\nво время прыжка\nнажимай пробел,\nчтобы сделать двойной прыжок\nR-перезагрузить игру\nEsc-выйти"; break;
	case 1: missionText = "\nMission 1\nСобери всевозможные\n монетки.\nНе забывай, что\n хп восстанавливается\nбочками с водой \nи разумеется\nопасайся кольев"; break;
	case 2: missionText = "\nMission 2\nПопробуй забраться на башню\nТам есть сюрприз"; break;
	case 3: missionText = "\nMission 3\nИщи бдительнее\nВезде есть секреты"; break;
	}
	return missionText;//ф-ция возвращает текст
};